[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # azurerm_app_service.app_service[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_app_service" "app_service" {
      [32m+[0m [0m[1m[0mapp_service_plan_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mapp_settings[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mclient_affinity_enabled[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mdefault_site_hostname[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0menabled[0m[0m                        = true
      [32m+[0m [0m[1m[0mhttps_only[0m[0m                     = false
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                       = "canadacentral"
      [32m+[0m [0m[1m[0mname[0m[0m                           = "EsDCCPPDappservice"
      [32m+[0m [0m[1m[0moutbound_ip_addresses[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mpossible_outbound_ip_addresses[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m            = "EsDCCPPDrg"
      [32m+[0m [0m[1m[0msite_credential[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0msource_control[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                           = {
          [32m+[0m [0m"Branch"         = "IITB"
          [32m+[0m [0m"Classification" = "ULL"
          [32m+[0m [0m"Directorate"    = "BOSS"
          [32m+[0m [0m"Environment"    = "DEV"
          [32m+[0m [0m"Project"        = "CPP-D"
          [32m+[0m [0m"ServiceOwner"   = "calvin.rodo@014gc.microsoftonline.com"
        }

      [32m+[0m [0mauth_settings {
          [32m+[0m [0m[1m[0madditional_login_params[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mallowed_external_redirect_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdefault_provider[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m                        = (known after apply)
          [32m+[0m [0m[1m[0missuer[0m[0m                         = (known after apply)
          [32m+[0m [0m[1m[0mruntime_version[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mtoken_refresh_extension_hours[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtoken_store_enabled[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0munauthenticated_client_action[0m[0m  = (known after apply)

          [32m+[0m [0mactive_directory {
              [32m+[0m [0m[1m[0mallowed_audiences[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mclient_id[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m     = (sensitive value)
            }

          [32m+[0m [0mfacebook {
              [32m+[0m [0m[1m[0mapp_id[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mapp_secret[0m[0m   = (sensitive value)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m = (known after apply)
            }

          [32m+[0m [0mgoogle {
              [32m+[0m [0m[1m[0mclient_id[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m = (sensitive value)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m  = (known after apply)
            }

          [32m+[0m [0mmicrosoft {
              [32m+[0m [0m[1m[0mclient_id[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mclient_secret[0m[0m = (sensitive value)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m  = (known after apply)
            }

          [32m+[0m [0mtwitter {
              [32m+[0m [0m[1m[0mconsumer_key[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mconsumer_secret[0m[0m = (sensitive value)
            }
        }

      [32m+[0m [0mconnection_string {
          [32m+[0m [0m[1m[0mname[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mvalue[0m[0m = (sensitive value)
        }

      [32m+[0m [0midentity {
          [32m+[0m [0m[1m[0midentity_ids[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mprincipal_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtenant_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }

      [32m+[0m [0mlogs {
          [32m+[0m [0mapplication_logs {
              [32m+[0m [0mazure_blob_storage {
                  [32m+[0m [0m[1m[0mlevel[0m[0m             = (known after apply)
                  [32m+[0m [0m[1m[0mretention_in_days[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0msas_url[0m[0m           = (sensitive value)
                }
            }

          [32m+[0m [0mhttp_logs {
              [32m+[0m [0mazure_blob_storage {
                  [32m+[0m [0m[1m[0mretention_in_days[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0msas_url[0m[0m           = (sensitive value)
                }

              [32m+[0m [0mfile_system {
                  [32m+[0m [0m[1m[0mretention_in_days[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mretention_in_mb[0m[0m   = (known after apply)
                }
            }
        }

      [32m+[0m [0msite_config {
          [32m+[0m [0m[1m[0malways_on[0m[0m                = true
          [32m+[0m [0m[1m[0mdotnet_framework_version[0m[0m = "v4.0"
          [32m+[0m [0m[1m[0mftps_state[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mhttp2_enabled[0m[0m            = true
          [32m+[0m [0m[1m[0mip_restriction[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mlinux_fx_version[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mlocal_mysql_enabled[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mmanaged_pipeline_mode[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mmin_tls_version[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mremote_debugging_enabled[0m[0m = false
          [32m+[0m [0m[1m[0mremote_debugging_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mscm_type[0m[0m                 = "None"
          [32m+[0m [0m[1m[0mwebsockets_enabled[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mwindows_fx_version[0m[0m       = (known after apply)

          [32m+[0m [0mcors {
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0msupport_credentials[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mstorage_account {
          [32m+[0m [0m[1m[0maccess_key[0m[0m   = (sensitive value)
          [32m+[0m [0m[1m[0maccount_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmount_path[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mshare_name[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }
    }

[1m  # azurerm_app_service_plan.app_service_plan[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_app_service_plan" "app_service_plan" {
      [32m+[0m [0m[1m[0mapp_service_environment_id[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m                         = "Linux"
      [32m+[0m [0m[1m[0mlocation[0m[0m                     = "canadacentral"
      [32m+[0m [0m[1m[0mmaximum_elastic_worker_count[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mmaximum_number_of_workers[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                         = "EsDCCPPDasp"
      [32m+[0m [0m[1m[0mper_site_scaling[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mreserved[0m[0m                     = true
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m          = "EsDCCPPDrg"
      [32m+[0m [0m[1m[0mtags[0m[0m                         = {
          [32m+[0m [0m"Branch"         = "IITB"
          [32m+[0m [0m"Classification" = "ULL"
          [32m+[0m [0m"Directorate"    = "BOSS"
          [32m+[0m [0m"Environment"    = "DEV"
          [32m+[0m [0m"Project"        = "CPP-D"
          [32m+[0m [0m"ServiceOwner"   = "calvin.rodo@014gc.microsoftonline.com"
        }

      [32m+[0m [0mproperties {
          [32m+[0m [0m[1m[0mapp_service_environment_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mper_site_scaling[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mreserved[0m[0m                   = (known after apply)
        }

      [32m+[0m [0msku {
          [32m+[0m [0m[1m[0mcapacity[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0msize[0m[0m     = "B1"
          [32m+[0m [0m[1m[0mtier[0m[0m     = "Standard"
        }
    }

[1m  # azurerm_container_registry.container_registry[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_container_registry" "container_registry" {
      [32m+[0m [0m[1m[0madmin_enabled[0m[0m       = true
      [32m+[0m [0m[1m[0madmin_password[0m[0m      = (sensitive value)
      [32m+[0m [0m[1m[0madmin_username[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "canadacentral"
      [32m+[0m [0m[1m[0mlogin_server[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                = "EsDCCPPDr"
      [32m+[0m [0m[1m[0mnetwork_rule_set[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m = "EsDCCPPDrg"
      [32m+[0m [0m[1m[0msku[0m[0m                 = "Standard"
      [32m+[0m [0m[1m[0mtags[0m[0m                = {
          [32m+[0m [0m"Branch"         = "IITB"
          [32m+[0m [0m"Classification" = "ULL"
          [32m+[0m [0m"Directorate"    = "BOSS"
          [32m+[0m [0m"Environment"    = "DEV"
          [32m+[0m [0m"Project"        = "CPP-D"
          [32m+[0m [0m"ServiceOwner"   = "calvin.rodo@014gc.microsoftonline.com"
        }
    }

[1m  # azurerm_resource_group.resource_group[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource_group" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "canadacentral"
      [32m+[0m [0m[1m[0mname[0m[0m     = "EsDCCPPDrg"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"Branch"         = "IITB"
          [32m+[0m [0m"Classification" = "ULL"
          [32m+[0m [0m"Directorate"    = "BOSS"
          [32m+[0m [0m"Environment"    = "DEV"
          [32m+[0m [0m"Project"        = "CPP-D"
          [32m+[0m [0m"ServiceOwner"   = "calvin.rodo@014gc.microsoftonline.com"
        }
    }

[0m[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"